Repository: JorgeTorresPadron/SaveYourRecipes
Catalog: SaveYourRecipes/SaveYourRecipes/Strings/Strings.*.resx
Languages: es

# acercadeview_cuarto_texto
source: SQLite Documentation
es: Documentación de SQLite

# acercadeview_idiomas_disponibles
source: Available in the following languages
es: Disponible en los idiomas siguientes

# acercadeview_primer_texto
source: Application to store food recipes created by Jorge Torres Padrón using Xamarin Forms and SQLite for the final project of the cross-platform application development cycle
es: Aplicación para almacenar recetas de comida creada por Jorge Torres Padrón usando Xamarin Forms y SQLite para el proyecto final del ciclo de desarrollo de aplicaciones multiplataforma

# acercadeview_segundo_texto
source: Follow me on GitHub
es: Sígueme en GitHub

# acercadeview_tercer_texto
source: Xamarin Forms Documentation
es: Documentación de Xamarin Forms

# acercadeview_tercer_texto_link
source: https://docs.microsoft.com/en-us/xamarin/xamarin-forms/
es: https://docs.microsoft.com/es-es/xamarin/xamarin-forms/

# cambiarcontrasenaview_cambiar_contrasena_button
source: Change password
es: Cambiar contraseña

# cambiarcontrasenaview_contrasena_entry
source: Enter the user's new password
es: Escribe la nueva contraseña del usuario

# cambiarcontrasenaview_contrasena_label
source: Password
es: Contraseña

# cambiarcontrasenaview_inicio_sesion_button
source: Back to login
es: Volver al inicio de sesión

# cambiarcontrasenaview_repetir_contrasena_entry
source: Repeat the new user password
es: Repite la nueva contraseña de usuario

# cambiarcontrasenaview_titulo
source: CHANGE PASSWORD
es: CAMBIAR CONTRASEÑA

# cambiarcontrasenaview_usuario_entry
source: Enter the username
es: Escribe el nombre de usuario

# cambiarcontrasenaview_usuario_label
source: Username
es: Nombre de usuario

# configuracionview_acerca_de
source: About...
es: Acerca de...

# configuracionview_configuracion_label
source: CONFIGURATION
es: CONFIGURACIÓN

# configurationview_cerrar_sesion
source: Log off
es: Cerrar sesión

# configurationview_eliminar_usuario
source: Delete my username
es: Eliminar mi usuario

# editarrecetaview_actualizar_receta_button
source: Update recipe changes
es: Actualizar cambios en la receta

# editarrecetaview_actualizar_receta_label
source: Update recipe
es: Actualizar receta

# eliminarusuarioview_advertencia_label
source: Attention! This action is not reversible if you delete the user you will lose the application data
es: ¡Atención! Esta acción no es reversible si borras el usuario perderás los datos de la aplicación

# eliminarusuarioview_contrasena_entry
source: Enter your user password
es: Escribe tu contraseña de usuario

# eliminarusuarioview_contrasena_label
source: Password
es: Contraseña

# eliminarusuarioview_eliminar_usuario_button
source: Delete my username
es: Eliminar mi usuario

# eliminarusuarioview_nombre_entry
source: Enter your username
es: Escribe tu nombre de usuario

# eliminarusuarioview_nombre_label
source: Username
es: Nombre de usuario

# eliminarusuarioview_titulo
source: USER DELETION
es: ELIMINACIÓN DEL USUARIO

# iniciarsesionview_contrasena_entry
source: Enter your password
es: Escribe la contraseña

# iniciarsesionview_contrasena_label
source: Password
es: Contraseña

# iniciarsesionview_iniciar_sesion_button
source: Log in
es: Iniciar Sesion

# iniciarsesionview_nombre_entry
source: Enter the username
es: Escribe el nombre de usuario

# iniciarsesionview_nombre_label
source: Username
es: Nombre de usuario

# iniciarsesionview_no_tiene_cuenta_button
source: Don't have an account? Sign in
es: ¿No tienes una cuenta? Registrate

# iniciarsesionview_olvida_contrasena_button
source: Forgot your password?
es: ¿Olvidaste la contraseña?

# iniciarsesionview_titulo
source: LOG IN TO CONTINUE
es: INICIA SESIÓN PARA CONTINUAR

# misrecetasview_actualizar_receta_button
source: Update recipe
es: Actualizar receta

# misrecetasview_eliminar_receta_button
source: Remove recipe
es: Eliminar receta

# misrecetasview_mis_recetas_label
source: MY RECIPES
es: MIS RECETAS

# misrecetasview_mostrar_receta_button
source: Show stored recipes
es: Mostrar recetas almacenadas

# nuevacategoriaview_eliminar_categoria_button
source: Delete category
es: Eliminar categoría

# nuevacategoriaview_modificar_categoria_button
source: Modify category
es: Modificar categoría

# nuevacategoriaview_nueva_categoria_button
source: Save category
es: Guardar categoría

# nuevacategoriaview_nueva_categoria_entry
source: Enter the category you want to add
es: Escribe la categoría que quieres añadir

# nuevacategoriaview_titulo
source: ADD A NEW FOOD CATEGORY
es: AÑADIR UNA NUEVA CATEGORÍA DE COMIDA

# nuevarecetaview_anadir_categoria_button
source: Add category
es: Añadir categoría

# nuevarecetaview_anadir_categoria_picker
source: Select the category
es: Selecciona la categoría

# nuevarecetaview_anadir_pais_button
source: Add country
es: Añadir país

# nuevarecetaview_anadir_pais_picker
source: Select the country
es: Selecciona el país

# nuevarecetaview_categoria_comida
source: Select the category to which it belongs
es: Selecciona la categoría a la que pertenece

# nuevarecetaview_descripcion_receta
source: Write the recipe description
es: Escribe la descripción de la receta

# nuevarecetaview_guardar_nueva_receta
source: Save Recipe
es: Guardar Receta

# nuevarecetaview_ingredientes_receta
source: Write the ingredients of the recipe
es: Escribe los ingredientes de la receta

# nuevarecetaview_nombre_receta
source: Enter the name of the recipe
es: Escribe el nombre de la receta

# nuevarecetaview_nueva_receta_label
source: NEW RECIPE
es: NUEVA RECETA

# nuevarecetaview_pasos_receta
source: Write the steps of the recipe
es: Escribe los pasos de la receta

# nuevarecetaview_tiempo_cocina
source: Write down the cooking time of the recipe
es: Escribe el tiempo de cocina de la receta

# nuevarecetaview_tiempo_preparacion
source: Write down the recipe preparation time
es: Escribe el tiempo de preparación de la receta

# nuevopaisview_eliminar_pais_button
source: Delete country
es: Eliminar país

# nuevopaisview_modificar_pais_button
source: Modify country
es: Modificar país

# nuevopaisview_nuevo_pais_button
source: Save country
es: Guardar país

# nuevopaisview_nuevo_pais_entry
source: Enter the country you want to add
es: Escribe el país que quieres añadir

# nuevopaisview_titulo
source: ADD A COUNTRY
es: AÑADIR UN PAÍS

# registrarseview_apellido_real_entry
source: Write your last name
es: Escribe tu apellido

# registrarseview_apellido_real_label
source: Last Name
es: Apellido

# registrarseview_contrasena_entry
source: Enter your password
es: Escribe la contraseña

# registrarseview_contrasena_label
source: Password
es: Contraseña

# registrarseview_edad_entry
source: Enter your age
es: Escribe tu edad

# registrarseview_edad_label
source: Age
es: Edad

# registrarseview_nombre_entry
source: Enter the username
es: Escribe el nombre de usuario

# registrarseview_nombre_label
source: Username
es: Nombre de usuario

# registrarseview_nombre_real_entry
source: Write your first name
es: Escribe tu nombre

# registrarseview_nombre_real_label
source: First Name
es: Nombre

# registrarseview_registrarse_button
source: Register
es: Registrarse

# registrarseview_repetir_contrasena_entry
source: Repeat the password you just typed
es: Repite la contraseña que acabas de escribir

# registrarseview_tiene_cuenta_button
source: Already have an account? Log in
es: ¿Ya tienes una cuenta? Inicia Sesión

# registrarseview_titulo
source: CREATE A NEW ACCOUNT TO CONTINUE
es: CREA UNA NUEVA CUENTA PARA CONTINUAR

# tabbed_page_configuracion_title
source: Settings
es: Configuración

# tabbed_page_mis_recetas_title
source: My Recipes
es: Mis Recetas

# tabbed_page_nueva_receta_title
source: New Recipe
es: Nueva Receta

# volver_al_menu_principal_button
source: Back to main menu
es: Volver al menú principal

# display_alert_aceptar
source: Accept
es: Aceptar

# display_alert_eliminado
source: Deleted
es: Eliminado

# display_alert_receta_eliminada
source: Recipe deleted correctly
es: Receta eliminada correctamente

# display_alert_error_iniciarsesionview
source: The user doesn't exist or the introduced data is incorrect
es: El usuario no existe o los datos introducidos son incorrectos

# display_alert_error_empty_username
source: You must enter a user name
es: Debe ingresar un nombre de usuario

# display_alert_error_empty_password
source: You must enter a password
es: Debe ingresar una contraseña

# display_alert_error_empty_firstname
source: You must enter your first name
es: Debes ingresar tu nombre

# display_alert_error_empty_lastname
source: You must enter your last name
es: Debes ingresar tu apellido

# display_alert_error_empty_age
source: You must enter your age
es: Debes ingresar tu edad

# display_alert_error_password_not_match
source: Repeated password is not the same
es: La contraseña repetida no es igual

# display_alert_success
source: Success
es: Éxito

# display_alert_welcome
source: Welcome
es: Bienvenido

# display_alert_cant_change_password_user_not_exist
source: The user you are trying to change the password does not exist
es: El usuario al que intentas cambiar la contraseña no existe

# display_alert_password_updated
source: Updated user password
es: Contraseña de usuario actualizada

# display_alert_delete_user_not_exist
source: The user you are trying to delete does not exist
es: El usuario que intentas eliminar no existe

# display_alert_user_delete_correctly
source: User successfully deleted
es: Usuario eliminado correctamente

# display_alert_category_stored
source: Successfully stored category
es: Categoría almacenada correctamente

# display_alert_category_updated
source: Successfully modified category
es: Categoría modificada correctamente

# display_alert_category_deleted
source: Successfully deleted category
es: Categoría eliminada correctamente
